// 정확성  테스트
// 테스트 1 〉	통과 (0.17ms, 43.2MB)
// 테스트 2 〉	통과 (0.09ms, 43.3MB)
// 테스트 3 〉	통과 (0.16ms, 43.3MB)
// 테스트 4 〉	통과 (0.18ms, 43.5MB)
// 테스트 5 〉	통과 (0.09ms, 43.5MB)
// 테스트 6 〉	통과 (0.20ms, 43.4MB)
// 테스트 7 〉	통과 (0.08ms, 43.3MB)
// 테스트 8 〉	통과 (0.18ms, 43.3MB)
// 테스트 9 〉	통과 (0.16ms, 43.1MB)
// 테스트 10 〉	통과 (0.19ms, 43.4MB)
// 테스트 11 〉	통과 (0.15ms, 43.5MB)
// 테스트 12 〉	통과 (0.10ms, 43.3MB)
// 테스트 13 〉	통과 (0.10ms, 43.5MB)
// 테스트 14 〉	통과 (0.15ms, 43.4MB)
// 효율성  테스트
// 테스트 1 〉	통과 (11.33ms, 48.3MB)
// 테스트 2 〉	통과 (0.51ms, 43.6MB)
// 테스트 3 〉	통과 (0.37ms, 42.7MB)
// 테스트 4 〉	통과 (0.31ms, 42.4MB)
// 테스트 5 〉	통과 (1.28ms, 43.7MB)
// 테스트 6 〉	통과 (0.71ms, 44.8MB)
// 채점 결과
// 정확성: 70.0
// 효율성: 30.0
// 합계: 100.0 / 100.0
function solution(n) {
  const MOD = 1000000007;

  let prev2 = 1;
  let prev1 = 2;
  let current = 0;

  if (n === 1) return prev2;
  if (n === 2) return prev1;

  for (let i = 3; i <= n; i++) {
    current = (prev1 + prev2) % MOD;
    prev2 = prev1;
    prev1 = current;
  }

  return prev1;
}
